УТ_для_edt.ДоставкаДеловыеЛинии/src/Catalogs/ДЛ_СпециальныеТребования/ДЛ_СпециальныеТребования.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ДЛ_СпециальныеТребования</name>
  <attributes>
    <name>UID</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Несовместимость</name>
    <attributes>
      <name>UID</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

УТ_для_edt.ДоставкаДеловыеЛинии/src/Catalogs/ДЛ_СпециальныеТребования/ManagerModule.bsl
Функция ПолучитьМассивПоляПоиска() Экспорт 
	
	Возврат ДЛ_ДеловыеЛинии.МассивДвухЭлементов("uid", "UID");
	
КонецФункции  

Функция ПолучитьТаблицуПолейЗначений() Экспорт
	
	Результат = ДЛ_ДеловыеЛинии.НоваяТаблицаПолейЗначений();
	ДЛ_ДеловыеЛинии.ДобавитьСтрокуВТаблицуПолейЗначений(Результат, "title", "Наименование", "Реквизит"); 
	ДЛ_ДеловыеЛинии.ДобавитьСтрокуВТаблицуПолейЗначений(Результат, "name", "Описание", "Реквизит");	
	ДЛ_ДеловыеЛинии.ДобавитьСтрокуВТаблицуПолейЗначений(Результат, "incompatible", "Несовместимость", "ТабличнаяЧасть", Новый Структура("UID", Неопределено));	
	
	Возврат Результат;
	
КонецФункции
